Revit 2026 API

# OccupancyUnit Enumeration

---

An enumerated type listing the occupancy unit of measure for a space object.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum OccupancyUnit
```
```vb
Public Enumeration OccupancyUnit
```
```cpp
public enum class OccupancyUnit
```
```fsharp
type OccupancyUnit
```

| Member name | Value | Description |
| --- | --- | --- |
| AreaPerPerson | 1 | OccupancyUnit is AreaPerPerson. |
| BySpaceType | -1 | OccupancyUnit is BySpaceType. |
| NumberOfPeople | 0 | OccupancyUnit is NumberOfPeople. |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace